# coding=utf-8

from selenium import webdriver
from selenium.webdriver.common.by import By
import time
import urllib
import sys
reload(sys)
sys.setdefaultencoding("utf-8")

'''
注意点1:
由于在豆瓣中查询电影之后的响应是由json文件或ajax动态响应生成,所以直接向搜索的url发送请求后
的响应是不包含电影的链接的,所以选择由PhantomJS无界面浏览器来获取页面加载完成后的所有html代码,
之后再解析出电影的具体链接

注意点2:
由于豆瓣有一些反爬虫的措施,比如同一个ip在短时间内发送多次请求后,返回的请求就会为空
所以在爬取电影详情时要在两次爬取之间加上时间间隔1秒或2秒
'''
search_url = "https://movie.douban.com/subject_search?search_text="

name_list = [
	"红海行动",
	"唐人街探案2",
	"捉妖记2",
	"复仇者联盟3",
	# "头号玩家",
	# "后来的我们",
	# "狂暴巨兽",
	# "无问西东",
	# "神秘巨星",
	# "西游记女儿国",
	# "黑豹",
	# "环太平洋：雷霆再起",
	# "熊出没·变形记",
	# "超时空同居",
	# "古墓丽影：源起之战",
	# "勇敢者游戏：决战丛林",
	# "厉害了，我的国",
	# "幕后玩家",
	# "移动迷宫3：死亡解药",
	# "小萝莉的猴神大叔",
	# "星球大战：最后的绝地武士",
	# "南极之恋",
	# "起跑线",
	# "奇迹男孩",
	# "寂静之地",
	# "公牛历险记",
	# "祖宗十九代",
	# "比得兔",
	# "21克拉",
	# "水形物语",
	# "马戏之王",
	# "巴霍巴利王2：终结",
	# "冰雪女王3：火与冰",
	# "游侠索罗：星球大战外传",
	# "湮灭",
	# "三块广告牌",
	# "闺蜜2",
	# "英雄本色2018",
	# "忌日快乐",
	# "暴裂无声",
	# "遇见你真好",
	# "谜巢",
	# "小马宝莉大电影",
	# "通勤营救",
	# "犬之岛",
	# "卧底巨星",
	# "战神纪",
	# "妈妈咪鸭",
	# "我是你妈",
	# "脱单告急",
	# "低压槽：欲望之城",
	# "奇葩朵朵",
	# "浪矢解忧杂货店",
	# "金龟子",
	# "坏爸爸",
	# "完美陌生人",
	# "猫与桃花源",
	# "玛丽与魔女之花",
	# "泡芙小姐",
	# "恋爱回旋",
	# "我说的都是真的",
	# "花滑女王",
	# "太空救援",
	# "大坏狐狸的故事",
	# "青年马克思",
	# "昼颜",
	# "金钱世界",
	# "狗狗的疯狂假期",
	# "萌犬好声音",
	# "24小时：末路重生",
	# "虎皮萌企鹅",
	# "人怕出名猪怕壮",
	# "脱皮爸爸",
	# "香港大营救",
	# "爱在记忆消逝前",
	# "战犬瑞克斯",
	# "小公主艾薇拉与神秘王国",
	# "麦兵兵之夺宝联“萌”",
	# "迷镇凶案",
	# "第三度嫌疑人",
	# "毕业作品",
	# "西北风云",
	# "出山记",
	# "寻找罗麦",
	# "龙在哪里？",
	# "S4侠降魔记",
	# "爱的帕斯卡",
	# "尖叫直播",
	# "大世界",
	# "青蛙总动员",
	# "莫斯科陷落",
	# "午夜十二点",
	# "米花之味",
	# "绝命时钟2",
	# "第一夫人",
	# "路过未来",
	# "时空偷渡少女",
	# "玲珑井",
	# "给19岁的我自己",
	# "凌晨两点半",
	# "亲爱的，我要和别人结婚了",
	# "小狗奶瓶",
	# "宇宙有爱浪漫同游",
	# "黄金花",
	# "大寒",
	# "一个人的课堂",
	# "超能太阳鸭",
	# "飞鸟历险记",
	# "灵魂当铺之时间典当",
	# "荒城纪",
	# "夺命来电",
	# "命运速递",
	# "西小河的夏天",
	# "尼斯：疯狂的心",
	# "无眸之杀",
	# "龙凤斗",
	# "村戏",
	# "理想之路",
	# "清水里的刀子",
	# "七号公馆",
	# "盲·道",
	# "冰封迷案",
	# "中邪",
	# "时空终点",
	# "无迹可寻",
	# "我的影子在奔跑",
	# "光影之战",
	# "余额不足",
	# "天籁梦想",
	# "玩命",
	# "破门",
	# "大雪冬至",
	# "疯狂熊孩子",
	# "柳毅奇缘",
	# "敦煌不了情",
	# "大导归来",
	# "毕业旅行笑翻天",
	# "求求你爱上我",
	# "我是哪吒",
	# "天下父母",
	# "壹号别墅",
	# "五度空间",
	# "落绕",
	# "擒贼先擒王",
	# "翻滚吧姐妹",
	# "天使的声音",
	# "潜艇总动员：海底两万里",
	# "十七后 与青春化敌为友",
	# "梭哈人生",
	# "三伏天",
	# "时间暗局",
	# "摇摇晃晃的人间",
	# "暗夜良人",
	# "告诉他们，我随白鹤去了",
	# "青春24秒",
	# "丢心",
	# "纯洁心灵·逐梦演艺圈",
	# "神谕通天",
	# "河间圣手",
	# "天梦",
	# "奔",
	# "只想好好和你在一起",
	# "爱情的单程列车",
	# "芒刺",
	# "醉佳导演",
	# "红月亮之武陵山歌",
	# "雪·葬",
	# "找爱之旅",
	# "雾都神探之绝情箭",
	# "乡村里的中国",
	# "寻找雪山",
	# "二师兄来了",
	# "爸爸的木房子",
	# "渠首欢歌",
	# "青春后驱动",
	# "幸福马上来",
	# "火魔高跟鞋",
	# "对戒",
	# "二麻租媳妇",
	# "策反",
	# "太阳总在左边",
	# "疯狂的公牛",
	# "半个月亮",
	# "冬",
	# "我来过",
	# "生门",
	# "莫名我就喜欢你",
	# "我的诗篇",
	# "花月影",
	# "阳光夏令营",
	# "寻找女神",
	# "爱是永恒",
	# "山河故人",
	# "我的老兵爷爷",
	# "因果启示录",
	# "时间监狱",
	# "任性的硬币"
]

def getUrls():
	real_urls = []
	# 用PhantomJS浏览器来加载页面
	driver = webdriver.PhantomJS()

	# 定义变量来记录抓取的电影数
	count = 1
	for i in name_list:
		# 加载由电影名查询出的页面
		real_url = search_url + urllib.quote(i)
		driver.get(real_url)
		# 由查询结果获得电影的url
		url = driver.find_elements(By.XPATH,'//div[@class="item-root"]')[0].find_element_by_tag_name("a").get_attribute('href')
		real_urls.append(url)
		# 打印出电影的相关信息
		print("%d: %s : %s " % (count,i,url))
		count += 1

	# 退出PhantomJS浏览器
	driver.quit()

	return real_urls




